; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	image1 - mode
	infrared3 - mode
	image2 - mode
	thermograph0 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument2 image2)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet11)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet11)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument4 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star6)
)
(:goal (and
	(have_image Star5 image2)
	(have_image Star6 image1)
	(have_image Star7 image2)
	(have_image Star8 infrared3)
	(have_image Planet9 thermograph0)
	(have_image Star10 image1)
	(have_image Planet11 thermograph0)
))

)

; plan
1. (turn_to satellite2 groundstation1 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 groundstation1)
   goals met: 0 of 7
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (calibrate satellite2 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 7
4. (turn_to satellite2 planet9 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet9)
   goals met: 0 of 7
5. (take_image satellite2 planet9 instrument2 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 1 of 7
6. (turn_to satellite2 planet11 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 planet11)
   goals met: 1 of 7
7. (turn_to satellite0 groundstation3 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation3)
   goals met: 1 of 7
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
9. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 1 of 7
10. (take_image satellite2 planet11 instrument2 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 2 of 7
11. (turn_to satellite0 star10 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star10)
   goals met: 2 of 7
12. (take_image satellite0 star10 instrument0 image1)
   added: (have_image star10 image1)
   goals met: 3 of 7
13. (turn_to satellite0 star6 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star6)
   goals met: 3 of 7
14. (take_image satellite0 star6 instrument0 image1)
   added: (have_image star6 image1)
   goals met: 4 of 7
15. (turn_to satellite0 star8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star8)
   goals met: 4 of 7
16. (take_image satellite0 star8 instrument0 infrared3)
   added: (have_image star8 infrared3)
   goals met: 5 of 7
17. (turn_to satellite2 star5 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star5)
   goals met: 5 of 7
18. (take_image satellite2 star5 instrument2 image2)
   added: (have_image star5 image2)
   goals met: 6 of 7
19. (turn_to satellite2 star7 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 star7)
   goals met: 6 of 7
20. (take_image satellite2 star7 instrument2 image2)
   added: (have_image star7 image2)
   goals met: 7 of 7
